CSI API ETABS v1

# cDCoACI318_19SetPreference Method

---

Sets the value of a concrete design preference item.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetPreference(
    	int Item,
    	double Value
    )

    Function SetPreference (
    	Item As Integer,
    	Value As Double
    ) As Integer

    Dim instance As cDCoACI318_19
    Dim Item As Integer
    Dim Value As Double
    Dim returnValue As Integer

    returnValue = instance.SetPreference(Item,
    	Value)

    int SetPreference(
    	int Item,
    	double Value
    )

    abstract SetPreference :
            Item : int *
            Value : float -> int

#### Parameters

Item

    Type: SystemInt32
This is an integer between 1 and 18, inclusive, indicating the preference item
considered.

  1. Number of interaction curves
  2. Number of interaction points
  3. Consider minimum eccentricity
  4. Design for B/C Capacity Ratio?
  5. Seismic design category
  6. Design System Omega0
  7. Design System Rho
  8. Design System Sds
  9. Consider ICC_ESR 2017
  10. Phi tension controlled
  11. Phi compression controlled tied
  12. Phi compression controlled spiral
  13. Phi shear and/or torsion
  14. Phi shear seismic
  15. Phi joint shear
  16. Pattern live load factor
  17. Utilization factor limit
  18. Multi-response case design

Value

    Type: SystemDouble
The value of the considered preference item.

  1. Number of interaction curves

Value >= 4 and divisable by 4

  2. Number of interaction points

Value >= 5 and odd

  3. Consider minimum eccentricity

0 = No

Any other value = Yes

  4. Design for B/C Capacity Ratio?

1 = No

2 = Yes

  5. Seismic design category
     * 1 = A
     * 2 = B
     * 3 = C
     * 4 = D
     * 5 = E
     * 6 = F
  6. Design System Omega0

Value > 0

  7. Design System Rho

Value > 0

  8. Design System Sds

Value >= 0

  9. Consider ICC_ESR 2017

1 = No

2 = Yes

  10. Phi tension controlled

Value > 0

  11. Phi compression controlled tied

Value > 0

  12. Phi compression controlled spiral

Value > 0

  13. Phi shear and/or torsion

Value > 0

  14. Phi shear seismic

Value > 0

  15. Phi joint shear

Value > 0

  16. Pattern live load factor

Value >= 0

  17. Utilization factor limit

Value > 0

  18. Multi-response case design
     * 1 = Envelopes
     * 2 = Step-by step
     * 3 = Last step
     * 4 = Envelopes - All
     * 5 = Step-by step - All

#### Return Value

Type: Int32
Returns zero if the item is successfully set; otherwise it returns a nonzero
value.

Remarks

Examples

VB

Copy

    Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Value As Double

    'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")

    'start ETABS application
      ret = EtabsObject.ApplicationStart()

    'create SapModel object
       SapModel = EtabsObject.SapModel

    'initialize model
       ret = SapModel.InitializeNewModel()

    'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)

    'create new concrete frame section property
       ret = SapModel.PropFrame.SetRectangle("R1", "4000Psi", 20, 12)

    'set frame section property
       ret = SapModel.FrameObj.SetSection("8", "R1")

    'set concrete design code
       ret = SapModel.DesignConcrete.SetCode("ACI 318-19")

    'run analysis
       System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
       ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
       ret = SapModel.Analyze.RunAnalysis

    'start concrete design
       ret = SapModel.DesignConcrete.StartDesign()

    'set preference item
       ret = SapModel.DesignConcrete.ACI318_19.SetPreference(2, 7)

    'get preference item
       ret = SapModel.DesignConcrete.ACI318_19.GetPreference(2, Value)

    'close ETABS
       EtabsObject.ApplicationExit(False)

    'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing

    End Sub

See Also

#### Reference

cDCoACI318_19 Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com